In [174]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\shaun\anaconda3\envs\dojo-env\lib\site-packages (1.4.49)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\shaun\anaconda3\envs\dojo-env\lib\site-packages (from sqlalchemy) (2.0.1)

In [260]:
## Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
## Importing the OS and JSON Modules
import os,json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine, MetaData
from sqlalchemy import String, Integer, Float, Text
from sqlalchemy import Column, Integer, String, Float, Text, ForeignKey , ARRAY, BOOLEAN , INTEGER
from sqlalchemy.ext.declarative import declarative_base

In [265]:
ratings = pd.read_csv('C:/Users/Shaun/Documents/GitHub/Data_Enrichment/data/title.ratings.tsv.gz')
ratings.head()

  tconst\taverageRating\tnumVotes
0            tt0000001\t5.7\t2002
1             tt0000002\t5.8\t269
2            tt0000003\t6.5\t1893
3             tt0000004\t5.5\t178
4            tt0000005\t6.2\t2678

In [198]:
basics = pd.read_csv('C:/Users/Shaun/Documents/GitHub/Data_Enrichment/data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama
2,tt0102362,movie,Istota,Istota,0,2000,NaN,80,"Drama,Romance"
3,tt0112912,movie,Dune 7,Dune 7,0,2002,NaN,97,Adventure
4,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000,NaN,86,"Musical,Romance"

In [283]:
imdb = pd.read_csv('C:/Users/Shaun/Documents/GitHub/Data_Enrichment/data/tmdb_results_combined.csv.gz')
imdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.00,1.0,NaN
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,7.00,3.0,NaN

## Getting a List of Unique Genres

In [199]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,[Drama]
2,tt0102362,movie,Istota,Istota,0,2000,NaN,80,"Drama,Romance","[Drama, Romance]"
3,tt0112912,movie,Dune 7,Dune 7,0,2002,NaN,97,Adventure,[Adventure]
4,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000,NaN,86,"Musical,Romance","[Musical, Romance]"
...,...,...,...,...,...,...,...,...,...,...
8638,tt9815124,movie,Mami Jarum,Mami Jarum,0,2002,NaN,95,"Comedy,Family,Romance","[Comedy, Family, Romance]"
8639,tt9815482,movie,The Witch,The Witch,0,2002,NaN,65,Horror,[Horror]
8640,tt9837894,movie,Tizca. Gli Uccelli Dipinti del Caucaso,Tizca. Gli Uccelli Dipinti del Caucaso,0,2001,NaN,91,Drama,[Drama]
8641,tt9853452,movie,Veszett idök,Veszett idök,0,2001,NaN,62,Fantasy,[Fantasy]
8642,tt9874290,movie,Star Trek: Incident at Beta 9,Star Trek: Incident at Beta 9,0,2002,NaN,57,Sci-Fi,[Sci-Fi]

In [200]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama,Drama
2,tt0102362,movie,Istota,Istota,0,2000,NaN,80,"Drama,Romance",Drama
...,...,...,...,...,...,...,...,...,...,...
8638,tt9815124,movie,Mami Jarum,Mami Jarum,0,2002,NaN,95,"Comedy,Family,Romance",Romance
8639,tt9815482,movie,The Witch,The Witch,0,2002,NaN,65,Horror,Horror
8640,tt9837894,movie,Tizca. Gli Uccelli Dipinti del Caucaso,Tizca. Gli Uccelli Dipinti del Caucaso,0,2001,NaN,91,Drama,Drama
8641,tt9853452,movie,Veszett idök,Veszett idök,0,2001,NaN,62,Fantasy,Fantasy
8642,tt9874290,movie,Star Trek: Incident at Beta 9,Star Trek: Incident at Beta 9,0,2002,NaN,57,Sci-Fi,Sci-Fi

In [201]:
## exploding the column of lists
genres_split = basics['genres'].str.split(",")

unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Adventure', 'Musical',
       'Action', 'Crime', 'Thriller', 'Music', 'Horror', 'Mystery',
       'Animation', 'Family', 'History', 'War', 'Sci-Fi', 'Biography',
       'Sport', 'Western', 'Adult', 'Reality-TV', 'News'], dtype=object)

In [217]:
basics.drop(['originalTitle', 'isAdult', 'genres'], axis=1, inplace=True)

In [218]:
basics.head()

,tconst,titleType,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0035423,movie,Kate & Leopold,2001,NaN,118,"[Comedy, Fantasy, Romance]"
1,tt0096056,movie,Crime and Punishment,2002,NaN,126,[Drama]
2,tt0102362,movie,Istota,2000,NaN,80,"[Drama, Romance]"
3,tt0112912,movie,Dune 7,2002,NaN,97,[Adventure]
4,tt0113026,movie,The Fantasticks,2000,NaN,86,"[Musical, Romance]"

## Clean Rating

In [270]:
# Split the 'tconst' column into three separate columns
ratings[['tconst', 'averageRating', 'numVotes']] = ratings['tconst\taverageRating\tnumVotes'].str.split('\t', expand=True)
# Drop the original combined column
ratings = ratings.drop('tconst\taverageRating\tnumVotes', axis=1)
ratings.head()

      tconst averageRating numVotes
0  tt0000001           5.7     2002
1  tt0000002           5.8      269
2  tt0000003           6.5     1893
3  tt0000004           5.5      178
4  tt0000005           6.2     2678

## Create a new title_genres table

In [203]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0096056        Drama
2  tt0102362        Drama

## Create a genre mapper dictionary to replace string genres with integers

In [204]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Comedy': 0,
 'Fantasy': 1,
 'Romance': 2,
 'Drama': 3,
 'Adventure': 4,
 'Musical': 5,
 'Action': 6,
 'Crime': 7,
 'Thriller': 8,
 'Music': 9,
 'Horror': 10,
 'Mystery': 11,
 'Animation': 12,
 'Family': 13,
 'History': 14,
 'War': 15,
 'Sci-Fi': 16,
 'Biography': 17,
 'Sport': 18,
 'Western': 19,
 'Adult': 20,
 'Reality-TV': 21,
 'News': 22}

In [ ]:
#genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
#genre_id_map

## Replace the string genres in title_genres with the new integer ids.

In [205]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop('genres_split', axis=1, inplace=True)
title_genres.head()

      tconst  genre_id
0  tt0035423         0
0  tt0035423         1
0  tt0035423         2
1  tt0096056         3
2  tt0102362         3

In [206]:
genre_lookup = pd.DataFrame({'Genre_Name': list(genre_id_map.keys()),
                             'Genre_ID': list(genre_id_map.values())})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Saving the MySQL tables with tconst as the primary key.

In [207]:
connection_str = "mysql+pymysql://root:toor@127.0.0.1/movies"
engine = create_engine(connection_str)

In [208]:
from sqlalchemy import create_engine, MetaData

# Define your engine and models
engine = create_engine('mysql+pymysql://root:toor@127.0.0.1/movies')
metadata = MetaData()

# Create all tables in the database
metadata.create_all(engine)

In [209]:
engine.execute("CREATE DATABASE IF NOT EXISTS movies")

## title_genres

In [210]:
# Calculate max string lengths for object columns
tconst_len = title_genres['tconst'].fillna('').map(len).max()

In [211]:
title_genres_schema = {
    "tconst": String(tconst_len + 1),
    "genre_id": Integer()
}

In [212]:
# Save to sql with dtype, index=False, and set the primary key
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema, if_exists='replace', index=False)

# Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`, `genre_id`);')

In [289]:
q = """
SELECT *
FROM title_genres
LIMIT 5;
"""

pd.read_sql(q, engine)

Exception during reset or similar
Traceback (most recent call last):
  File "C:\Users\Shaun\anaconda3\envs\dojo-env\lib\site-packages\pymysql\connections.py", line 760, in _write_bytes
    self._sock.sendall(data)
ConnectionAbortedError: [WinError 10053] An established connection was aborted by the software in your host machine

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\Users\Shaun\anaconda3\envs\dojo-env\lib\site-packages\sqlalchemy\pool\base.py", line 763, in _finalize_fairy
    fairy._reset(pool, transaction_was_reset)
  File "C:\Users\Shaun\anaconda3\envs\dojo-env\lib\site-packages\sqlalchemy\pool\base.py", line 1038, in _reset
    pool._dialect.do_rollback(self)
  File "C:\Users\Shaun\anaconda3\envs\dojo-env\lib\site-packages\sqlalchemy\engine\default.py", line 683, in do_rollback
    dbapi_connection.rollback()
  File "C:\Users\Shaun\anaconda3\envs\dojo-env\lib\site-packages\pymysql\connections.py", line 481, in rollback
    self._execute_command(COMMAND.COM_QUERY, "ROLLBACK")
  File "C:\Users\Shaun\anaconda3\envs\dojo-env\lib\site-packages\pymysql\connections.py", line 818, in _execute_command
    self._write_bytes(packet)
  File "C:\Users\Shaun\anaconda3\envs\dojo-env\lib\site-packages\pymysql\connections.py", line 763, in _write_bytes
    raise err.OperationalError(
pymysql.err.OperationalError: (2006, "MySQL server has gone away (ConnectionAbortedError(10053, 'An established connection was aborted by the software in your host machine', None, 10053, None))")

      tconst  genre_id
0  tt0035423         0
1  tt0035423         1
2  tt0035423         2
3  tt0096056         3
4  tt0102362         2

## Genres

In [213]:
title_genres_schema = {
    "Genre_Name": String(tconst_len + 1),
    "Genre_ID": Integer()
}

In [214]:
# Save to sql with dtype, index=False, and set the primary key
genre_lookup.to_sql('genres', engine, dtype=title_genres_schema, if_exists='replace', index=False)

23

In [215]:
# Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_Name`, `Genre_ID`);')

In [290]:
q = """
SELECT *
FROM genres
LIMIT 5;
"""

pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## title_basics

In [223]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8643 entries, 0 to 8642
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          8643 non-null   object
 1   titleType       8643 non-null   object
 2   primaryTitle    8643 non-null   object
 3   startYear       8643 non-null   int64
 4   endYear         0 non-null      float64
 5   runtimeMinutes  8643 non-null   int64
 6   genres_split    8643 non-null   object
dtypes: float64(1), int64(2), object(4)
memory usage: 472.8+ KB

In [261]:
title_basics_schema = {
    'tconst': VARCHAR(20),
    'titleType': VARCHAR(255),
    'primaryTitle': VARCHAR(255),
    'originalTitle': VARCHAR(255),
    'isAdult': BOOLEAN(),
    'startYear': INTEGER(),
    'endYear': INTEGER(),
    'runtimeMinutes': INTEGER(),
    'genres': VARCHAR(255),
}

In [262]:
basics['genres_split'] = basics['genres_split'].apply(lambda x: ', '.join(x))

In [263]:
# Create the table without the primary key
basics.to_sql('title_basics', engine, dtype=title_basics_schema, if_exists='replace', index=False)

8643

In [264]:
# Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [291]:
q = """
SELECT *
FROM title_basics
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst averageRating numVotes
0  tt0000001           5.7     2002
1  tt0000002           5.8      269
2  tt0000003           6.5     1893
3  tt0000004           5.5      178
4  tt0000005           6.2     2678

## title_ratings

In [280]:
title_ratings_schema = {
    "tconst": String(255),  # Use String instead of VARCHAR
    'averageRating': String(255),
    'numVotes': Integer,  # Assuming numVotes is an integer
}

In [281]:
# Recreate the table with the new schema
ratings.to_sql('title_ratings', engine, dtype=title_ratings_schema, if_exists='replace', index=False)

1359838

In [282]:
# Add the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [292]:
q = """
SELECT *
FROM title_ratings
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst averageRating  numVotes
0  tt0000001           5.7      2002
1  tt0000002           5.8       269
2  tt0000003           6.5      1893
3  tt0000004           5.5       178
4  tt0000005           6.2      2678

## tmdb_data

In [286]:
title_tmdb_data_schema = {
    "tconst" : Column(String(255), primary_key=True),
    "averageRating" : Column(String(255)),
    "numVotes" : Column(Integer),
    "imdb_id" : Column(String(255)),
    "adult" : Column(Integer),
    "backdrop_path" : Column(String(255)),
    "belongs_to_collection" : Column(String(255)),
    "budget" : Column(Integer),
    "genres" : Column(String(255)),
    "homepage" : Column(String(255)),
    "id" : Column(Integer),
    "original_language" : Column(String(255)),
    "original_title" : Column(String(255)),
    "overview" : Column(String(255)),
    "popularity" : Column(Integer),
    "poster_path" : Column(String(255)),
    "production_companies" : Column(String(255)),
    "production_countries" : Column(String(255)),
    "release_date" : Column(String(255)),
    "revenue" : Column(Integer),
    "runtime" : Column(Integer),
    "spoken_languages" : Column(String(255)),
    "status" : Column(String(255)),
    "tagline" : Column(String(255)),
    "title" : Column(String(255)),
    "video" : Column(Integer),
    "vote_average" : Column(Integer),
    "vote_count" : Column(Integer),
    "certification" : Column(String(255))
}

In [287]:
# Recreate the table with the new schema
imdb.to_sql('tmdb_data', engine, dtype=title_ratings_schema, if_exists='replace', index=False)

4586

In [293]:
q = """
SELECT *
FROM tmdb_data
LIMIT 5;
"""

pd.read_sql(q, engine)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,None,None,NaN,None,None,NaN,None,None,...,NaN,NaN,None,None,None,None,NaN,NaN,NaN,None
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,None,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",None,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.50,22.0,None
2,tt0113092,0.0,None,None,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",None,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.45,10.0,None
3,tt0116391,0.0,None,None,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",None,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,None,Gang,0.0,4.00,1.0,None
4,tt0116748,0.0,/wr0hTHwkYIRC82MwNbhOvqrw27N.jpg,None,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",None,579396.0,hi,Karobaar,...,0.0,180.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,The Business of Love,Karobaar,0.0,7.00,3.0,None

## Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

In [294]:
show_tables_query = """
SHOW TABLES;
"""

# Execute the query and display the result
tables_result = pd.read_sql(show_tables_query, engine)
print(tables_result)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data